[{"id":"134679","title":"Resveratrol","imageUrl":"https://arbornutrition.co/wp-content/uploads/2020/05/RESVERATROL-lifestyle-1000x1000.jpg","description":"Resveratrol is a powerful flavonoid that provides health benefits through cell signaling and antioxidant effects. Because of that, it can help prevent cell damage that is believed to be the cause of aging and other health issues.","price":"18.95"},{"id":"134680","title":"Turmeric with Ginger","imageUrl":"https://arbornutrition.co/wp-content/uploads/2020/05/turmeric-w-ginger-main-1000x1000.jpg","description":"Our maximum strength Turmeric Curcumin and Ginger supplements have 95% standardized curcuminoids. This organic turmeric supplement comes with BioPerine (turmeric with Black Pepper) for premium bioavailability and exceptionally fast absorption.","price":"18.95"},{"id":"134681","title":"Mega Mobility","imageUrl":"https://arbornutrition.co/wp-content/uploads/2020/05/mobility-main-img-1000x1000.jpg","description":"Chondroitin & Glucosamine is a complete dietary supplement designed to give joint support and pain relief from the finest of ingredients. Our powerful nutrient compound promotes greater joint health, range of motion and natural body comfort.","price":"17.95"},{"id":"134682","title":"Vital Vision","imageUrl":"https://arbornutrition.co/wp-content/uploads/2020/05/lutein-main-img-1000x1000.jpg","description":"Blue light emitting screens and mobile phone overuse is becoming more of an issue with increasing time spent in front of digital devices. Our lutein and zeaxanthin supplement is made with a selected blend of natural ingredients that support blue light protection.","price":"14.95"},{"id":"134683","title":"Fat Burner","imageUrl":"https://arbornutrition.co/wp-content/uploads/2020/05/FAT-BURNER-MAIN-IMG-1000x1000.jpg","description":"We didn’t want to just provide you with another fat burner. We created a blend that combined with regular exercise, can help boost your energy, focus & cognition, helping you perform better when you workout or go on an adventure.","price":"18.95"},{"id":"134684","title":"Blood Sugar MD","imageUrl":"https://arbornutrition.co/wp-content/uploads/2020/05/blood-sugar-md-main-img-1000x1000.jpg","description":"Magnesium and Vitamin B12 deficiencies are very common with Type 2 Diabetes. These deficiencies can aggravate insulin resistance and contribute to heart risk and nerve pain. We formulated this diabetic support supplement to provide you with the dose you are missing.","price":"15.95"}]